package com.isomorphisms.mathcharacters;

final class MathCharacters {
    static final String[][] ROWS = {
        {"←", "↑", "↓", "→", "↔", "↦", "⇒"},
        {"ℂ", "ℝ", "ℚ", "ℤ", "ℕ", "∞"},
        {"i", "j", "k"},
        {"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
        {"⁰", "¹", "²", "³", "⁴", "⁵", "⁶", "⁷", "⁸", "⁹", "⁺", "⁻", "⁼", "⁽", "⁾", "ⁱ", "ʲ", "ᵏ", "ˡ", "ⁿ"},
        {"₀", "₁", "₂", "₃", "₄", "₅", "₆", "₇", "₈", "₉", "₊", "₋", "₌", "₍", "₎", "ᵢ", "ⱼ", "ₖ", "ₗ"}
    };

    private MathCharacters() {}
}
